{
    "Description": {
        "Id": "3045-11-15",
        "Name": "",
        "Details": "<b>McKinnon's Company contraraids Menke - McCarron's Armored Cavalry caught unaware</b>r\n\r\n\r\n\r\n\r\nWhile the official statements from public relations remain tight-lipped about the intricate details of the operations, confidential insiders, speaking under the veil of anonymity, have disclosed exclusive information to our sources. It has come to light that the operation to exact retribution upon [[DM.BaseDescriptionDefs[LoreMercBigMAC],McCarron's Armored Cavalry]] for their audacious raids on Commonwealth territories, particularly the infamous Marlette raid last year, was directly ordered by none other than Hanse Davion himself.\r\n\r\n\r\nFor this challenging assignment, McKinnon's Company, independent company under [[DM.Factions[faction_DavionA7],7th Crucis Lancers]] and also a renowned unit renowned for their expertise in special operations, was handpicked. The task at hand was to deliver a resounding blow to McCarron's Armored Cavalry and their stronghold in [[DM.SystemDefs[starsystemdef_Menke],Menke]], which serves as a center for their civilian business interests. Taking advantage of the opportune moment when MAC's regiments were dispersed across Liao worlds on the Davion front, Menke's garrison had been reduced to a mere battalion, creating the perfect opening for Ian McKinnon and his forces to strike.",
        "Icon": "uixTxrTimeLine_DonegalBroadcastingCompany.png"
    },
    "Scope": "Company",
    "Weight": 0,
    "Requirements": {
        "Scope": "Company",
        "RequirementTags": {
            "items": null,
            "tagSetSourceFile": ""
        },
        "ExclusionTags": {
            "items": null,
            "tagSetSourceFile": ""
        },
        "RequirementComparisons": []
    },
    "AdditionalRequirements": [],
    "AdditionalObjects": [],
    "Options": [
        {
            "Description": {
                "Id": "continue",
                "Name": "Continue Broadcast",
                "Details": "Broadcast continues",
                "Icon": ""
            },
            "RequirementList": [],
            "ResultSets": [
                {
                    "Description": {
                        "Id": "continue2",
                        "Name": "Donegal Broadcasting Company",
                        "Details": "Reports suggest that the raiders meticulously spent an entire week dismantling supply depots, crippling repair facilities, and relentlessly targeting any entity affiliated with MAC, even going so far as to disrupt a local golf course. The defenders, represented by the 3rd Battalion of the [[DM.Factions[faction_LiaoA13],2nd McCarron's Armored Cavalry]], responded with haste, but found themselves overwhelmingly outmatched. In an attempt to locate the elusive raiders, the MAC commander made the ill-fated decision to split her battalion, leading to Kitagawa's 2nd company unknowingly stumbling into a series of meticulously orchestrated ambushes.\r\n\r\n\r\nHaving accomplished their mission with precision, McKinnon's Company swiftly departed from the planet before the Capellan response could muster significant force.\r\n\r\n\r\n\r\nNovember 3045 Edition of DBC Monthly News Recap: Stay in the Know!",
                        "Icon": ""
                    },
                    "Weight": 100,
                    "Results": [
                        {
                            "Scope": "Company",
                            "Requirements": null,
                            "AddedTags": {
                                "items" : [
                                ],
                                "tagSetSourceFile" : ""
                            
                            },
                            "RemovedTags": {
                                "items": null,
                                "tagSetSourceFile": ""
                            },
                            "Stats": null,
                            "Actions": null,
                            "ForceEvents": null,
                            "TemporaryResult": false,
                            "ResultDuration": 0
                        }
                    ]
                }
            ],
            "Requirements": {
                "Scope": "Company",
                "RequirementTags": {
                    "items": null,
                    "tagSetSourceFile": ""
                },
                "ExclusionTags": {
                    "items": null,
                    "tagSetSourceFile": ""
                },
                "RequirementComparisons": []
            }
        }
    ],
    "PublishState": "PUBLISHED",
    "ValidationState": "UNTESTED",
    "EventType": "UNSELECTABLE"
}
